AUTO_config_TK_pesok/src/DataProcessors/ЗакрытиеОбработкаЗаказовПоставщику/ЗакрытиеОбработкаЗаказовПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗакрытиеОбработкаЗаказовПоставщику</name>
</mdclass:DataProcessor>

AUTO_config_TK_pesok/src/AccumulationRegisters/ОбработкаЗаказовПоставщику/ОбработкаЗаказовПоставщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОбработкаЗаказовПоставщику</name>
  <resources>
    <name>Обработан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозОперация</name>
    <comment>Хозяйственная операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AUTO_config_TK_pesok/src/Documents/КорректировкаРегистров/КорректировкаРегистров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаРегистров</name>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.РасчетыСПоставщикамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.РезервыТоваров</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказовПоставщику</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровКомпании</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПокупателямиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиОрганизации</registerRecords>
  <registerRecords>InformationRegister.ОграничениеАссортимента</registerRecords>
  <registerRecords>InformationRegister.ЦеныКонтрагентов</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваВКассахККМ</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваровКомпании</registerRecords>
  <registerRecords>InformationRegister.Цены</registerRecords>
  <registerRecords>InformationRegister.ПараметрыСистемыЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКПоступлению</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваКомпании</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаРегистров</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/DataProcessors/ЗакрытиеОбработкаЗаказовПоставщику/ManagerModule.bsl
Функция СформироватьКорректировку(НаДату,ДнейОтсрочки,Ошибки="")	Экспорт 
	ВсеОК = Истина;
	СрокПоставки = НачалоДня(НаДату)-86400*ДнейОтсрочки;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	|	ОбработкаЗаказовПоставщикуОстатки.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ОбработкаЗаказовПоставщикуОстатки.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ОбработкаЗаказовПоставщикуОстатки.ЗаказПоставщику.СрокПоставки КАК СрокПоставки,
	|	ОбработкаЗаказовПоставщикуОстатки.ОбработанОстаток КАК ОбработанОстаток
	|ИЗ
	|	РегистрНакопления.ОбработкаЗаказовПоставщику.Остатки(&НаДату, ) КАК ОбработкаЗаказовПоставщикуОстатки
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ОбработкаЗаказовПоставщикуОстатки.ЗаказПоставщику.СрокПоставки = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ОбработкаЗаказовПоставщикуОстатки.ЗаказПоставщику.Дата, ДЕНЬ, 7), ДЕНЬ)
	|			ИНАЧЕ ОбработкаЗаказовПоставщикуОстатки.ЗаказПоставщику.СрокПоставки
	|		КОНЕЦ <= &СрокПоставки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказПоставщику
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("НаДату", КонецДня(НаДату));
	Запрос.УстановитьПараметр("СрокПоставки", СрокПоставки);
	
	Результат = Запрос.Выполнить();	//	Результат.Выгрузить()
	Выборка = Результат.Выбрать();
	
	нпп = 0;
	НуженДок = Истина;
	
	Пока Выборка.СледующийПоЗначениюПоля("ЗаказПоставщику") Цикл 
		
		Если НуженДок Тогда
			дОбъект = Документы.КорректировкаРегистров.СоздатьДокумент();
			дОбъект.Дата = ТекущаяДата();	
			дОбъект.Ответственный = Пользователи.ТекущийПользователь();
			дОбъект.Комментарий = "Корректировка Обработка заказа поставщику"+Символы.ПС+"Сформирован автоматически "+дОбъект.Дата;
			СтрокаТЧ = дОбъект.ТаблицаРегистров.Добавить();
			СтрокаТЧ.Имя = "ОбработкаЗаказовПоставщику";
			
			Попытка
				дОбъект.Записать();
				НуженДок = Ложь;
				НаборЗаписей=РегистрыНакопления.ОбработкаЗаказовПоставщику.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Значение=дОбъект.Ссылка;
			Исключение
				ОписаниеОшибки = ОписаниеОшибки();
				ЗаписьЖурналаРегистрации("АвтоЗакрытиеОбработкаЗаказа",УровеньЖурналаРегистрации.Ошибка,дОбъект,,ОписаниеОшибки);
				ВсеОК = Ложь;
				Ошибки = Ошибки + ?(СтрДлина(Ошибки)=0, "", Символы.ПС) + ОписаниеОшибки;
				Продолжить;
			КонецПопытки;
			
		КонецЕсли;
		
		Пока Выборка.Следующий() Цикл
			нпп = нпп + 1;
			Движение=НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Движение,Выборка);
			Движение.Регистратор = дОбъект.Ссылка;
			Движение.Период = дОбъект.Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Обработан = -Выборка.ОбработанОстаток;
			Движение.ХозОперация = Справочники.ХозОперации.КорректировкаУчетныхДанных;
		КонецЦикла;
		
		Если нпп > 8888 Тогда
			нпп = 0;
			НуженДок = Истина;
		КонецЕсли;
		
		Попытка
			НаборЗаписей.Записать(Ложь);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации("АвтоЗакрытиеОбработкаЗаказа",УровеньЖурналаРегистрации.Ошибка,дОбъект,,ОписаниеОшибки);
			ВсеОК = Ложь;
			Ошибки = Ошибки + ?(СтрДлина(Ошибки)=0, "", Символы.ПС) + ОписаниеОшибки;
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат  ВсеОК;	
КонецФункции
